DataProcessors/АР17_ЗаполнениеПолейШаблона.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>АР17_ЗаполнениеПолейШаблона</Name>
			<Comment>Заполение полей шаблоне внешнего документа</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АР_ТипыДокументовПечатныхФорм</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазваниеШаблона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлШаблона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ШаблоныДокументов</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектИК</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АР17_УстановкаПараметровИК</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВыбранныеПоля</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Поле</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формат</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСтрокиТЧ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Catalogs/АР_ШаблоныДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>АР_ШаблоныДокументов</Name>
			<Comment>Шаблоны документов MS Word</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УдалитьФайлШаблона</Name>
					<Comment>Файл шаблона документа MS Word DOC</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДокумент</Name>
					<Comment>Для документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьШаблон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Comment>Имя файла</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АР_ТипыДокументовПечатныхФорм</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Хранилище</Name>
					<Comment>Хранилище</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектИК</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АР17_УстановкаПараметровИК</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВыбранныеПоля</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Поле</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формат</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСтрокиТЧ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/АР17_ЗаполнениеПолейШаблона/Forms/ФормаУправляемая/Ext/Form/Module.bsl
&НаКлиенте
Перем VB;

&НаКлиенте
Перем WordDoc;

///////////////////////////////
// Вспомогательные процедуры и функции

&НаСервере
Функция ПолучитьИмяДокументаПоТипу()
	
	Если ЗначениеЗаполнено(Объект.ТипДокумента) Тогда
		Возврат Метаданные.Перечисления.АР_ТипыДокументовПечатныхФорм.ЗначенияПеречисления.Получить(Перечисления.АР_ТипыДокументовПечатныхФорм.Индекс(Объект.ТипДокумента)).Имя;
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьИмяРеквизитаПоСинониму(СинонимРеквизита)
	
	ИмяДокумента = ПолучитьИмяДокументаПоТипу();
	ИмяРеквита = "";
	Если ЗначениеЗаполнено(ИмяДокумента) Тогда
		Для Каждого Реквизит Из Метаданные.Документы[ИмяДокумента].Реквизиты Цикл
			Если Реквизит.Синоним = СинонимРеквизита Тогда
				ИмяРеквита = Реквизит.Имя;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат ИмяРеквита;
	
КонецФункции

// Процедура выполняет загрузку настроек отбора из настроек по умолчанию.
//
&НаСервере
Процедура ЗагрузитьНастройкиОтбораПоУмолчанию()
	
	Если Не ЗначениеЗаполнено(Объект.ТипДокумента) Тогда
		Возврат;
	КонецЕсли;
	ИмяДокумента = ПолучитьИмяДокументаПоТипу();
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	СхемаКомпоновкиДанных = ОбработкаОбъект.ПолучитьМакет(ИмяДокумента);	
	КомпоновщикНастроек.Инициализировать(
		Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, ЭтаФорма.УникальныйИдентификатор))
	);
	
КонецПроцедуры // ЗагрузитьНастройкиОтбораПоУмолчанию()

&НаСервере
Функция СоздатьШаблонПечатнойФормы(ИмяФайла, АдресФайлаВоВременномХранилище)
	
	СправочникШаблонов = Справочники.АР_ШаблоныДокументов.СоздатьЭлемент();
	СправочникШаблонов.Наименование = Объект.НазваниеШаблона;
	СправочникШаблонов.ТипДокумента = Объект.ТипДокумента;
	СправочникШаблонов.ИмяФайла = ИмяФайла;
	СправочникШаблонов.ОбъектИК = Объект.ОбъектИК;
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресФайлаВоВременномХранилище);
	СправочникШаблонов.Хранилище = Новый ХранилищеЗначения(ДвоичныеДанные);
	СправочникШаблонов.Записать();
	
	Возврат СправочникШаблонов.Ссылка;
	
КонецФункции

&НаСервере
Процедура ПерезаписатьШаблон(АдресФайлаВоВременномХранилище = Неопределено)
	
	СправочникШаблонов = Объект.ФайлШаблона.ПолучитьОбъект();
	СправочникШаблонов.Наименование = Объект.НазваниеШаблона;
	СправочникШаблонов.ОбъектИК = Объект.ОбъектИК;
	
	// Настройки полей
	СправочникШаблонов.ВыбранныеПоля.Очистить();
	СправочникШаблонов.ВыбранныеПоля.Загрузить(Объект.ВыбранныеПоля.Выгрузить());
	
	Если Не АдресФайлаВоВременномХранилище = Неопределено Тогда
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресФайлаВоВременномХранилище);
		СправочникШаблонов.Хранилище = Новый ХранилищеЗначения(ДвоичныеДанные);
	КонецЕсли;
	СправочникШаблонов.Записать();

КонецПроцедуры

&НаСервере
Функция ЗаполнениеМассиваСтрокМодуля()
	
	ТекстМакроса = "";
	ТекстПроцедурЗаполнения = "";
	ТекстДобавленияМеню = "";
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	//Макросы = ОбработкаОбъект.ПолучитьМакет("МодульШаблона2007");
	//Макросы = ОбработкаОбъект.ПолучитьМакет("МодульШаблона2007НовыйТолькоСписок");
	Макросы = ОбработкаОбъект.ПолучитьМакет("МодульШаблона2007Новый");
	Кв = Символ(34);
	Пс = Символ(10);
	
	ШаблонПроцедуры = ПолучитьТекстМакроса(Макросы, "ВставкаПоле");
	ШаблонДобавленияМеню = ПолучитьТекстМакроса(Макросы, "СформироватьМенюСтрока");
	
	Номер = 1;
	Для Каждого СтрокаТаб Из Объект.ВыбранныеПоля Цикл  
		Индекс = СокрЛП(Формат(Номер, "ЧЦ=10"));
		ИмяПоля = СтрокаТаб.Поле;
		Если ЗначениеЗаполнено(СтрокаТаб.НомерСтрокиТЧ) Тогда
			ПозицияТочки = Найти(ИмяПоля, ".");
			Если ПозицияТочки > 0 Тогда
				ИмяПоля = Лев(ИмяПоля, ПозицияТочки - 1) + "[" + Формат(СтрокаТаб.НомерСтрокиТЧ, "ЧГ=0") + "]." + Сред(ИмяПоля, ПозицияТочки + 1);
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаТаб.Формат) Тогда
			ИмяПоля = ИмяПоля; //+ "(" + СтрокаТаб.Формат + ")"; // + NAI Becar Комментирование Смирнов А.А. от 31.10.2022 17:07
		КонецЕсли;
		ТекстПроцедуры = ШаблонПроцедуры;
		ТекстПроцедуры = СтрЗаменить(ТекстПроцедуры, "[Поле]", ИмяПоля);
		ТекстПроцедуры = СтрЗаменить(ТекстПроцедуры, "[Номер]", Индекс);
		ТекстДобавленияПунктаМеню = ШаблонДобавленияМеню;
		ТекстДобавленияПунктаМеню = СтрЗаменить(ТекстДобавленияПунктаМеню, "[Поле]", ИмяПоля);
		ТекстДобавленияПунктаМеню = СтрЗаменить(ТекстДобавленияПунктаМеню, "[Номер]", Индекс);
		ТекстДобавленияПунктаМеню = СтрЗаменить(ТекстДобавленияПунктаМеню, "[Группа]", "False");
		Номер = Номер + 1;
		ТекстПроцедурЗаполнения = ТекстПроцедурЗаполнения + ТекстПроцедуры;
		ТекстДобавленияМеню = ТекстДобавленияМеню + ТекстДобавленияПунктаМеню;
	КонецЦикла;	
	
	ТекстМакроса = "";
	ТекстМакроса = ТекстМакроса + ПолучитьТекстМакроса(Макросы, "Переменные");
	ТекстМакроса = ТекстМакроса + ПолучитьТекстМакроса(Макросы, "ДобавитьПунктМеню");
	ТекстМакроса = ТекстМакроса + ТекстПроцедурЗаполнения;
	ТекстМакроса = ТекстМакроса + ПолучитьТекстМакроса(Макросы, "СформироватьМенюНачало");
	ТекстМакроса = ТекстМакроса + ТекстДобавленияМеню;
	ТекстМакроса = ТекстМакроса + ПолучитьТекстМакроса(Макросы, "СформироватьМенюКонец");
	ТекстМакроса = ТекстМакроса + ПолучитьТекстМакроса(Макросы, "УдалитьМеню");
	
	Возврат ТекстМакроса;
	
КонецФункции

&НаСервере
Функция ПолучитьТекстМакроса(Макросы, ИмяОбласти)
	
	ТекстОбласти = "";
	Область = Макросы.ПолучитьОбласть(ИмяОбласти);
	Для Сч = 1 По Область.ВысотаТаблицы Цикл
		ТекстОбласти = ТекстОбласти + Область.ПолучитьОбласть(Сч, 1).ТекущаяОбласть.Текст + Символ(10);
	КонецЦикла;
	Возврат ТекстОбласти;
	
КонецФункции

&НаКлиенте
Процедура ОткрытиеШаблона(ТекстМакроса)
	
	vbext_ct_StdModule=1; 
	Если ТипЗнч(Объект.ФайлШаблона) = Тип("Строка") Тогда
		Если Не ЗначениеЗаполнено(ПолноеИмяФайла) Тогда
			Возврат;
		КонецЕсли;
		Файл = Новый Файл(Строка(КаталогВременныхФайлов()) + ПолноеИмяФайла);
		Если Не Файл.Существует() Тогда
			Возврат; 
		КонецЕсли;
	Иначе
		Если Не СохранитьФайл() Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	VB = Новый COMOBject("Word.Application");
	Попытка
		WordDoc = VB.Documents.Open(Строка(КаталогВременныхФайлов()) + ПолноеИмяФайла,,0);
		ДобавитьОбработчик WordDoc.Close, ЗакрытиеДокумента;
	Исключение
		Сообщить("Не удалось открыть файл");
		Возврат;
	КонецПопытки;
	VB.Visible = 1;
	
	Попытка 
		КоличествоКомпонент = VB.Application.ActiveDocument.VBProject.VBComponents.Count;
		Для Сч = 1 По КоличествоКомпонент Цикл
			Ном = КоличествоКомпонент - Сч + 1;
			Если VB.Application.ActiveDocument.VBProject.VBComponents(Ном).Type = 1 Тогда
				VB.Application.ActiveDocument.VBProject.VBComponents.Remove(VB.Application.ActiveDocument.VBProject.VBComponents(Ном));
			КонецЕсли; 
		КонецЦикла;
		New_Mod = VB.Application.ActiveDocument.VBProject.VBComponents.Add(vbext_ct_StdModule);
		New_Mod.CodeModule.AddFromString (ТекстМакроса);
		Vb.Application.Run("BuildControls");
		wdWindowStateMaximize = 1;
		Vb.Visible=-1; 
		Vb.Activate();        
		Vb.WindowState=wdWindowStateMaximize;
	Исключение          
		ТекстСообщения = "В файле шаблона установите <<Флажок>> : Сервис  -- Параметры -- Безопасность -- Защита от Макросов -- Надежные источники -- Доверять доступ к Visual Basic Project";
		Предупреждение(ТекстСообщения);
		VB = "";
		Возврат; 
	КонецПопытки;	
	
	ОткрытьПросмотр = Вопрос("Для работы с файлом шаблона, перейдите в окно 
	                          |     MS Word. После окнчания работы с 
	                          |          шаблоном нажмите ОК",
	РежимДиалогаВопрос.ОК);
	Попытка
		WordDoc.Save();
		WordDoc.Close();
		Если VB.Documents.Count = 0 Тогда 
			VB.Quit();
		КонецЕсли;
		WordDoc = Неопределено;
	Исключение
	КонецПопытки;
	VB = "";
	
КонецПроцедуры	

&НаСервере
Функция ПолучитьРеквизитНаСервере(Источник, Реквизит)
	
	Возврат Источник[Реквизит];
	
КонецФункции

&НаКлиенте
// Процедура сохраняет значение реквизита Хранилище (двоичные данные) на диск.
// При необходимости открывает файл с использованием ассоциированного с ним приложения.
//
// Параметры:
//  ИмяВнешнегоФайла - путь, имя файла дле сохранения на диске
//  Запустить - булево, признак запускать ассоциированное с файлом приложение.
//
Функция СохранитьФайл()
	
	ИмяФайла = ПолучитьРеквизитНаСервере(Объект.ФайлШаблона, "ИмяФайла");
	
	// Получить расширение файла.
	РасширениеВременногоФайла = Прав(ИмяФайла, 4);
	
	Если Лев(РасширениеВременногоФайла, 1) = "." Тогда
		// Получить имя временного файла. Установить расширение временного файла.
		РасширениеВременногоФайла = Прав(ИмяФайла, 3);
	КонецЕсли;
	
	Если ВРег(РасширениеВременногоФайла) <> "DOC" И  ВРег(РасширениеВременногоФайла) <> "DOCX" Тогда // Файл не является word-овским
		Сообщить("Файл шаблона не является файлом Word", СтатусСообщения.Важное);
		Возврат Ложь;
	КонецЕсли;
		
	// Сохранить файл на диске
	ДанныеФайла = ПолучитьДанныеФайла();
	ПолноеИмяФайла = ПолучитьИмяВременногоФайла(РасширениеВременногоФайла);
	ФайлМожноОткрывать = ПолучитьФайлВРабочийКаталог(ДанныеФайла.СсылкаНаДвоичныеДанныеФайла);
	
	Возврат ФайлМожноОткрывать;
		
КонецФункции // СохранитьЗапуститьФайл()

&НаСервере
Функция ПолучитьДанныеФайла()
	
	ДвоичныеДанные = Объект.ФайлШаблона.Хранилище.Получить();
	СсылкаНаДвоичныеДанныеФайла = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("СсылкаНаДвоичныеДанныеФайла", СсылкаНаДвоичныеДанныеФайла);
	
	Возврат СтруктураДанных;
	
КонецФункции

&НаКлиенте
// Получает данные файла с сервера и записывает их в каталог на диске
// Параметры:
//  СсылкаНаДвоичныеДанныеФайла - адрес во временном хранилище с двоичными данными, либо навигационная ссылка на данные файла в ИБ
//  ОтносительныйПуть - путь к файлу относительно рабочего каталога
//  ДатаМодификацииУниверсальная - Дата - универсальная дата модификации файла
//  ИмяФайла - Строка - имя файла (с расширением)
//
// Возвращаемое значение: булево
// Истина - файл получен и сохранен успешно, иначе Ложь
//
// ОСОБЫЕ УСЛОВИЯ
// Требуется наличие подключенного расширения для работы с файлами.
//
Функция ПолучитьФайлВРабочийКаталог(СсылкаНаДвоичныеДанныеФайла) Экспорт
	
	Файл = Новый Файл(ПолноеИмяФайла);
	Если Файл.Существует() Тогда
		Файл.УстановитьТолькоЧтение(Ложь);
		УдалитьФайлы(ПолноеИмяФайла);
	КонецЕсли;
	
	ПолучаемыйФайл = Новый ОписаниеПередаваемогоФайла(ПолноеИмяФайла, СсылкаНаДвоичныеДанныеФайла);
	ПолучаемыеФайлы = Новый Массив;
	ПолучаемыеФайлы.Добавить(ПолучаемыйФайл);
	
	ПолученныеФайлы = Новый Массив;
	
	Если ПолучитьФайлы(ПолучаемыеФайлы, ПолученныеФайлы, , Ложь) Тогда
		ПолноеИмяФайла = ПолученныеФайлы[0].Имя;
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
// Процедура подключаемая в качестве обработчика при закрытии документа Microsoft Word
// Подключается в процедуре динамически "ОткрытиеШаблона"
Процедура ЗакрытиеДокумента()
	
	ПолноеИмяФайла = WordDoc.FullName;
	Попытка
		Vb.Application.Run("RemoveContentMenuItem");
	Исключение
	    //ОписаниеОшибки()
	КонецПопытки;
	УдалитьОбработчик WordDoc.Close, ЗакрытиеДокумента;
	WordDoc = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборФайла() 
	
	ДиалогФыбораФайла								=	Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогФыбораФайла.Фильтр						=	"Файл шаблона MS Word(*.doc; *.docx)|*.doc; *.docx";
	ДиалогФыбораФайла.Расширение					=	"doc";
	ДиалогФыбораФайла.Заголовок						=	"Выберите файл";
	ДиалогФыбораФайла.ПредварительныйПросмотр		=	Ложь;
	ДиалогФыбораФайла.ИндексФильтра					=	0;
	ДиалогФыбораФайла.ПолноеИмяФайла				=	ПолноеИмяФайла;
	ДиалогФыбораФайла.ПроверятьСуществованиеФайла	=	Истина;
	Если ДиалогФыбораФайла.Выбрать() Тогда
		ПолноеИмяФайла = ДиалогФыбораФайла.ПолноеИмяФайла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ОбработатьТекстПоля(ТекстСтроки)
	
	ПозицияТочки = Найти(ТекстСтроки, ".");
	Если ПозицияТочки > 0 Тогда
		Группа = Лев(ТекстСтроки, ПозицияТочки - 1);
		Если Не (Группа = "ПостояннаяЧастьАренднойПлаты" 
			ИЛИ Группа = "ПеременнаяЧастьАренднойПлаты") Тогда
			ТекстСтроки = Сред(ТекстСтроки, ПозицияТочки + 1);
		КонецЕсли;
	КонецЕсли;
	ТекстСтроки = СтрЗаменить(ТекстСтроки, "ПостояннаяЧастьАренднойПлаты", "ПостояннаяЧасть");
	ТекстСтроки = СтрЗаменить(ТекстСтроки, "ПеременнаяЧастьАренднойПлаты", "ПеременнаяЧасть");
	Возврат ТекстСтроки;
		
КонецФункции

&НаСервере
Процедура ДобавитьПоле(ИмяПоля,ФорматСтроки = "")
	
	СтрПоиска = Новый Структура("Поле,Формат",ИмяПоля,ФорматСтроки);
	
	ВыбранныеПоля = Объект.ВыбранныеПоля.Выгрузить();
	МассивСтроки = ВыбранныеПоля.НайтиСтроки(СтрПоиска);
	
	Если МассивСтроки.Количество() = 0 Тогда
	//Если ВыбранныеПоля.Найти(ИмяПоля, "Поле") = Неопределено Тогда	
		НоваяСтрока = Объект.ВыбранныеПоля.Добавить();
		НоваяСтрока.Поле = ИмяПоля;
		Если ЗначениеЗаполнено(ФорматСтроки) Тогда
		    НоваяСтрока.Формат = ФорматСтроки;
		КонецЕсли;
		
		// + NAI Becar Комментирование Смирнов А.А. от 12.07.2017 14:50
		Если ИмяПоля = "ДолжностьРуководителяОрганизации" Тогда
			НоваяСтрока.Представление = "Генеральный Директор";
		ИначеЕсли ИмяПоля = "ФактическийАдресКонтрагента" Тогда
			НоваяСтрока.Представление = "105082, Москва г, Переведеновский пер, дом № 13, строение 16, этаж 2 Пом I Комн 42";
		ИначеЕсли ИмяПоля = "РуководительКонтрагента" Тогда
			НоваяСтрока.Представление = "Иванов Иван Петрович";
		ИначеЕсли ИмяПоля = "ЮридическийАдресКонтрагента" Тогда
			НоваяСтрока.Представление = "105082, Москва г, Переведеновский пер, дом № 13, строение 16, этаж 2 Пом I Комн 42";
		ИначеЕсли ИмяПоля = "ДолжностьРуководителяОрганизации" Тогда
			НоваяСтрока.Представление = "Генеральный Директор";
		ИначеЕсли ИмяПоля = "ФактическийАдресОрганизации" Тогда
			НоваяСтрока.Представление = "117639, Москва г, Варшавское ш, дом № 95, корпус 1";
		ИначеЕсли ИмяПоля = "РуководительКонтрагента" Тогда
			НоваяСтрока.Представление = "Иванов Иван Петрович";
		ИначеЕсли ИмяПоля = "РуководительОрганизации" Тогда
			НоваяСтрока.Представление = "Сорокин Алексей Васильевич";
		ИначеЕсли ИмяПоля = "ЮридическийАдресОрганизации" Тогда
			НоваяСтрока.Представление = "117639, Москва г, Варшавское ш, дом № 95, корпус 1";
		ИначеЕсли ИмяПоля = "ГенеральныйДиректорПолностьюВРодПадеже" Тогда
			НоваяСтрока.Представление = "Сорокина Алексея Васильевича";
		ИначеЕсли ИмяПоля = "ДоговорКонтрагента.Дата" и НЕ ЗначениеЗаполнено(ФорматСтроки) Тогда
			НоваяСтрока.Представление = "04.04.2017";
		ИначеЕсли ИмяПоля = "ДатаДоговора" и ЗначениеЗаполнено(ФорматСтроки) Тогда
			НоваяСтрока.Представление = "04 апреля 2017";
		ИначеЕсли ИмяПоля = "ИК.Наименование" Тогда
			НоваяСтрока.Представление = "Переведеновский";
		ИначеЕсли ИмяПоля = "ДоговорКонтрагента.Номер" Тогда
			НоваяСтрока.Представление = "2017-104-БЭ";
		ИначеЕсли ИмяПоля = "ОбеспечительныйПлатежНДС" и не ЗначениеЗаполнено(ФорматСтроки) Тогда
			НоваяСтрока.Представление = "8833,33";
		ИначеЕсли ИмяПоля = "ОбеспечительныйПлатежНДС" и ЗначениеЗаполнено(ФорматСтроки) Тогда
			НоваяСтрока.Представление = "восемь тысяч тридцать три валюта тридцать три валюта";
		ИначеЕсли ИмяПоля = "ОбеспечительныйПлатежСтоимость" и не ЗначениеЗаполнено(ФорматСтроки) Тогда
			НоваяСтрока.Представление = "7000";
		ИначеЕсли ИмяПоля = "ОбеспечительныйПлатежСтоимость" и ЗначениеЗаполнено(ФорматСтроки)  Тогда
			НоваяСтрока.Представление = "семь тысяч  валюта";
		ИначеЕсли ИмяПоля = "ОбеспечительныйПлатежУслуга" Тогда
			НоваяСтрока.Представление = "Обеспечительный платеж";
		ИначеЕсли ИмяПоля = "Организация.НаименованиеПолное" Тогда
			НоваяСтрока.Представление = "Общество с ограниченной ответственностью ""Бекар-Эксплуатация""";
		ИначеЕсли ИмяПоля = "ПеременнаяАренднаяПлатаСтоимость" и не ЗначениеЗаполнено(ФорматСтроки) Тогда
			НоваяСтрока.Представление = "25000";
		ИначеЕсли ИмяПоля = "ПеременнаяАренднаяПлатаСтоимость" и ЗначениеЗаполнено(ФорматСтроки) Тогда
			НоваяСтрока.Представление = "Двадцать пять тысяч  валюта";
		ИначеЕсли ИмяПоля = "ПеременнаяАренднаяПлатаУслуга" Тогда
			НоваяСтрока.Представление = "Переменная арендная плата";
		ИначеЕсли ИмяПоля = "ПеременнаяАренднаяПлатаНДС" и не ЗначениеЗаполнено(ФорматСтроки) Тогда
			НоваяСтрока.Представление = "120000";
		ИначеЕсли ИмяПоля = "ПеременнаяАренднаяПлатаНДС" и ЗначениеЗаполнено(ФорматСтроки) Тогда
			НоваяСтрока.Представление = "Сто двадцать тысяч";
		ИначеЕсли ИмяПоля = "Контрагент.НаименованиеПолное" Тогда
			НоваяСтрока.Представление = "Общество с ограниченной ответственностью ""КЕХРА""";
		ИначеЕсли ИмяПоля = "ФиксированнаяАрендаНДС"  и не ЗначениеЗаполнено(ФорматСтроки) Тогда
			НоваяСтрока.Представление = "180000";
		ИначеЕсли ИмяПоля = "ФиксированнаяАрендаНДС" и ЗначениеЗаполнено(ФорматСтроки) Тогда
			НоваяСтрока.Представление = "Сто восемьдесят тысяч";
		ИначеЕсли ИмяПоля = "ФиксированнаяАрендаУслуга" Тогда
			НоваяСтрока.Представление = " Постоянная арендная плата по договору аренды нежилых помещений № 15 от 01.02.2017";
		ИначеЕсли ИмяПоля = "ФиксированнаяАрендаСтоимость" и не ЗначениеЗаполнено(ФорматСтроки) Тогда
			НоваяСтрока.Представление = "150000";
		ИначеЕсли ИмяПоля = "ФиксированнаяАрендаСтоимость" и ЗначениеЗаполнено(ФорматСтроки) Тогда
			НоваяСтрока.Представление = "Сто пятьдесят тысяч";
		//ИначеЕсли ИмяПоля = "ДатаДоговора" и ЗначениеЗаполнено(ФорматСтроки) Тогда
		//	НоваяСтрока.Представление = Формат(ТекущаяДата(),"ДФ='дд ММММ yyyy'");
		КонецЕсли;	
		//Если Найти(ИмяПоля,"Дата") Тогда
		//	НоваяСтрока.Представление = Формат(ТекущаяДата(),НоваяСтрока.Формат);
		//КонецЕсли;
		// - NAI Becar Комментирование Смирнов А.А.

	Иначе
		// Проверим, если это строка ТЧ, то возможно уже выбрана конкретная строка
		ЕстьПоле = Ложь;
		Для Каждого СтрокаТаб Из Объект.ВыбранныеПоля Цикл
			Если СтрокаТаб.Поле = ИмяПоля И Не ЗначениеЗаполнено(СтрокаТаб.НомерСтрокиТЧ) И Не ЗначениеЗаполнено(СтрокаТаб.Формат) Тогда
				ЕстьПоле = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если Не ЕстьПоле Тогда
			НоваяСтрока = Объект.ВыбранныеПоля.Добавить();
			НоваяСтрока.Поле = ИмяПоля;
			Если ЗначениеЗаполнено(ФорматСтроки) Тогда
			    НоваяСтрока.Формат = ФорматСтроки;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

///////////////////////////////
// Обработчики событий формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Шаблон") Тогда
		Элементы.ФайлШаблона.Заголовок = "Шаблон";
		Объект.ФайлШаблона = Параметры.Шаблон;
		Объект.ТипДокумента = Параметры.Шаблон.ТипДокумента;
		Объект.НазваниеШаблона = Параметры.Шаблон.Наименование;
		Объект.ОбъектИК = Параметры.Шаблон.ОбъектИК;
		Элементы.ТипДокумента.Видимость = Ложь;
		
		Объект.ВыбранныеПоля.Загрузить(Параметры.Шаблон.ВыбранныеПоля.Выгрузить());
		
	Иначе
		Элементы.ФайлШаблона.Заголовок = "Файл шаблона";
		Объект.ФайлШаблона = "";
	КонецЕсли;
	
	Если ТипЗнч(Объект.ФайлШаблона) = Тип("Строка") Тогда
		ПолноеИмяФайла = Объект.ФайлШаблона;
	Иначе
		ПолноеИмяФайла = "";
	КонецЕсли;
	
	ЗагрузитьНастройкиОтбораПоУмолчанию();
	
	//Договор = Документы.АР17_ЗаключениеДоговораАренды.НайтиПоНомеру("АСМ 16/87",ТекущаяДата());
	
КонецПроцедуры

////////////////////////////////
// Обработчики нажатий кнопок

&НаКлиенте
Процедура Сохранить(Команда)
	
	Отказ = Не ЭтаФорма.ПроверитьЗаполнение();
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПолноеИмяФайла) Тогда
		Если ТипЗнч(Объект.ФайлШаблона) = Тип("СправочникСсылка.АР_ШаблоныДокументов") Тогда
			ПерезаписатьШаблон();
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Если WordDoc <> Неопределено Тогда
		Попытка
			WordDoc.Save();
			WordDoc.Close();
			WordDoc = Неопределено;
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	ПомещаемыеФайлы = Новый Массив;
	Описание = Новый ОписаниеПередаваемогоФайла(ПолноеИмяФайла, "");
	ПомещаемыеФайлы.Добавить(Описание);
	
	ПомещенныеФайлы = Новый Массив;
	
	Если НЕ ПоместитьФайлы(ПомещаемыеФайлы, ПомещенныеФайлы, , Ложь) Тогда
		Сообщить("Ошибка при помещении файла в хранилище: " + ПолноеИмяФайла, СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;
	
	АдресВременногоХранилищаФайла = ПомещенныеФайлы[0].Хранение;
	Файл = Новый Файл(ПолноеИмяФайла);
	
	Если ТипЗнч(Объект.ФайлШаблона) = Тип("Строка") Тогда
		
		Объект.ФайлШаблона = СоздатьШаблонПечатнойФормы(Файл.Имя, АдресВременногоХранилищаФайла);
		Элементы.ФайлШаблона.Заголовок = "Шаблон";
		Элементы.ТипДокумента.Видимость = Ложь;
		
		Оповестить("СозданШаблонВорд");
		
	Иначе
		
		ПерезаписатьШаблон(АдресВременногоХранилищаФайла);
		Сообщить("Файл шаблона - " + Объект.НазваниеШаблона + " перезаписан!");
		
	КонецЕсли;	
	
	ЭтаФорма.ВладелецФормы.Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура Редактировать(Команда)
	
	ТекстМакроса = ЗаполнениеМассиваСтрокМодуля();	
	ОткрытиеШаблона(ТекстМакроса);
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлШаблонаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ТипЗнч(Объект.ФайлШаблона) = Тип("Строка") Тогда
		ВыборФайла();
		Объект.ФайлШаблона = ПолноеИмяФайла;
	Иначе
		ПараметрыОтбора = Новый Структура();
		Отбор = Новый Структура("ТипДокумента", Объект.ТипДокумента);
		ПараметрыОтбора.Вставить("Отбор", Отбор);
		Форма = ПолучитьФорму("Справочник.АР_ШаблоныДокументов.Форма.ФормаВыбора", ПараметрыОтбора, Элемент);
		Форма.Открыть();
	КонецЕсли;
		   //Новый Структура("ТипДокумента", Объект.ТипДокумента)
КонецПроцедуры

&НаКлиенте
Процедура ТипДокументаПриИзменении(Элемент)
	
	ЗагрузитьНастройкиОтбораПоУмолчанию();
	
КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастроекВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	// + NAI Becar Матюхин Н.О. от 13.01.2017 12:35 по заявке № 
	Формат = "";
	Если Найти(ВыбраннаяСтрока,"Основные.") <> 0 Тогда
		
		ТекСтрокаПоле = Сред(ВыбраннаяСтрока,10);
		
		ПрописьюПоложение = Найти(ТекСтрокаПоле,"Прописью");
		Формат = "";
		Если ПрописьюПоложение <> 0 Тогда
			ТекСтрокаПоле = Лев(ТекСтрокаПоле,ПрописьюПоложение-2);
			Формат = "Прописью";
		КонецЕсли;
			
		ДатаСтрокойПоложение = Найти(ТекСтрокаПоле,"ДатаСтрокой");
		Если ДатаСтрокойПоложение <> 0 Тогда
			ТекСтрокаПоле = Лев(ТекСтрокаПоле,ДатаСтрокойПоложение-2);
			Формат  = "ДФ=дд ММММ гггг";
		КонецЕсли;
			
		ТекстСтроки = ПреобразоватьСтроку(ТекСтрокаПоле);
		
	Иначе	
	    ТекстСтроки = Строка(КомпоновщикНастроек.Настройки.ДоступныеПоляПорядка.ПолучитьОбъектПоИдентификатору(ВыбраннаяСтрока).Поле);
	КонецЕсли;
	// - NAI Becar Матюхин Н.О.
	
	ДобавитьПоле(ОбработатьТекстПоля(ТекстСтроки),Формат);
	
КонецПроцедуры

&НаКлиенте
Функция ПреобразоватьСтроку(ТекСтрока)
	
	Если Лев(ТекСтрока,1) = "[" Тогда
		ТекСтрока = Сред(ТекСтрока,2);
		
		Если Прав(ТекСтрока,1) = "]" Тогда
	        ТекСтрока = Лев(ТекСтрока,СтрДлина(ТекСтрока)-1);
		КонецЕсли;
	КонецЕсли;
	
	
	
	ТекСтрока = СтрЗаменить(ТекСтрока,"__"," ");
	
	МассивСтрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТекСтрока, "_");
	ТекСтрока = "";
	ДопРеквизиты = Ложь;
	
	Если СтрНайти(ТекСтрока,"ДопРеквизиты") <> 0 Тогда
		ДопРеквизиты = Истина;
	КонецЕсли;
	
	НачалоДопЭлементаОпределили = Ложь;
	
	Для каждого ТекЗнач Из МассивСтрок Цикл
		
		Добавка = "";
		Если НачалоДопЭлементаОпределили Тогда
			
			Добавка = "]";
			НачалоДопЭлементаОпределили = Ложь;
			ТекСтрока = ТекСтрока + ТекЗнач + Добавка + ".";
			Продолжить;
			
		ИначеЕсли ТекЗнач = "ДопРеквизиты" Тогда
			
			НачалоДопЭлементаОпределили = Истина;
			ТекСтрока = ТекСтрока + "[";
			Продолжить;
			
		КонецЕсли;
		
		ТекСтрока = ТекСтрока + ТекЗнач + ".";
	
	КонецЦикла;
	
	ТекСтрока = Лев(ТекСтрока,СтрДлина(ТекСтрока)-1);
	
	Возврат ТекСтрока;
	
КонецФункции


&НаКлиенте
Процедура КомпоновщикНастроекНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	ТекстСтроки = Строка(КомпоновщикНастроек.Настройки.ДоступныеПоляПорядка.ПолучитьОбъектПоИдентификатору(Элементы.КомпоновщикНастроек.ТекущаяСтрока).Поле);
	Если ТекстСтроки = "Основные" Тогда
		ОбработатьПапкуОсновныхРеквизитов();
	Иначе	
	    ДобавитьПоле(ОбработатьТекстПоля(ТекстСтроки));
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыводимыеПоляФорматНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	СписокВыбора = Новый СписокЗначений;
	СписокВыбора.Добавить("Прописью");
	СписокВыбора.Добавить("Произвольный формат");
	Элементы.ВыбранныеПоляФормат.СписокВыбора.ЗагрузитьЗначения(СписокВыбора.ВыгрузитьЗначения());

КонецПроцедуры

&НаКлиенте
Процедура ВыводимыеПоляФорматОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение = "Произвольный формат" Тогда
		СтандартнаяОбработка = Ложь;
		ТекущиеДанные = Элементы.ВыбранныеПоля.ТекущиеДанные;
		ТекстФормата = "";
		ТекущиеДанные.Формат = "";
		
		ФорматСтроки = Новый КонструкторФорматнойСтроки;
		ФорматСтроки.ОткрытьМодально();
		ТекущиеДанные.Формат = ФорматСтроки.Текст;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ДобавитьВесьБлок(Команда)
	
	ОбработатьПапкуОсновныхРеквизитов();

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПапкуОсновныхРеквизитов()
	
	ПолеОсновные = КомпоновщикНастроек.Настройки.ПользовательскиеПоля.ДоступныеПоляЗначений.Элементы.Найти("Основные");
	Если ПолеОсновные <> Неопределено Тогда
	 	Для каждого ТекЭлемент Из ПолеОсновные.Элементы Цикл
			//ТекстСтроки = Строка(КомпоновщикНастроек.Настройки.ДоступныеПоляПорядка.ПолучитьОбъектПоИдентификатору(ТекЭлемент.ТекущаяСтрока).Поле);
			
			ТекСтрокаПоле = Сред(Строка(ТекЭлемент.Поле),10);
			
			ПрописьюПоложение = Найти(ТекСтрокаПоле,"Прописью");
			Формат = "";
			Если ПрописьюПоложение <> 0 Тогда
				ТекСтрокаПоле = Лев(ТекСтрокаПоле,ПрописьюПоложение-2);
				Формат = "Прописью";
			КонецЕсли;
			
			ДатаСтрокойПоложение = Найти(ТекСтрокаПоле,"ДатаСтрокой");
			Если ДатаСтрокойПоложение <> 0 Тогда
				ТекСтрокаПоле = Лев(ТекСтрокаПоле,ДатаСтрокойПоложение-2);
				Формат  = "ДФ=дд ММММ гггг";
			КонецЕсли;
			
			
			ТекстСтроки = ПреобразоватьСтроку(ТекСтрокаПоле);
			
			ДобавитьПоле(ОбработатьТекстПоля(ТекстСтроки),Формат);
			
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьБлокПомещения(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	
	//ПечатьДоговора();
	АР_ОбщиеПроцедурыКлиент.ПечатьШаблонаВорд("16", Договор);
	
КонецПроцедуры

&НаСервере
Процедура ПечатьДоговора()
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбранныеПоляПриИзменении(Элемент)
	ТекДанные = Элемент.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекДанные.Формат) Тогда
		Если Найти(ТекДанные.Поле,"Дата") Тогда
			ТекДанные.Представление = Формат(ТекущаяДата(),ТекДанные.Формат);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ВыбранныеПоляФорматНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.ВыбранныеПоля.ТекущиеДанные;
	ВведенноеЗначение = ТекущиеДанные.Формат;
	ДополнительныеПараметры = Новый Структура("ВведенноеЗначение", ВведенноеЗначение);
	ОписаниеОповещения = Новый ОписаниеОповещения("ВвестиФорматЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВводСтроки(ОписаниеОповещения, ВведенноеЗначение, "Введите текст",,Истина);
КонецПроцедуры

&НаКлиенте
Процедура ВвестиФорматЗавершение(Строка, ДополнительныеПараметры) Экспорт
	
	ВведенноеЗначение = ?(Строка = Неопределено, ДополнительныеПараметры.ВведенноеЗначение, Строка);
	
	
	Если (Строка <> Неопределено) Тогда
		
		//ВведенноеЗначение = СокрЛП(ВведенноеЗначение);
		
		Элементы.ВыбранныеПоля.ТекущиеДанные.Формат = СокрЛП(ВведенноеЗначение); 
		
		//Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры
